PX4/PX4-Autopilot/platforms/nuttx/src/px4/nxp/imxrt/io_pins/io_timer.c
}

static inline void io_timer_set_PWM_mode(unsigned channel)
{
	irqstate_t flags = px4_enter_critical_section();
	uint16_t rvalue = rCTRL(channels_timer(channel), timer_io_channels[channel].sub_module);
	rvalue &= ~(SMCTRL_PRSC_MASK | SMCTRL_LDMOD);
	rvalue |= SMCTRL_PRSC_DIV16;
	rMCTRL(channels_timer(channel)) |= (timer_io_channels[channel].sub_module_bits >> MCTRL_LDOK_SHIFT) << MCTRL_CLDOK_SHIFT
					   ;
	rCTRL(channels_timer(channel), timer_io_channels[channel].sub_module)  = rvalue;
	rMCTRL(channels_timer(channel)) |= timer_io_channels[channel].sub_module_bits;
	px4_leave_critical_section(flags);
}

void io_timer_trigger(void)
{
	int oneshots = io_timer_get_mode_channels(IOTimerChanMode_OneShot);
	struct {
		uint32_t base;
		uint16_t triggers;
	} action_cache[MAX_IO_TIMERS] = {0};
	int actions = 0;

	/* Pre-calculate the list of channels to Trigger */
	int mask;

	for (int timer = 0; timer < MAX_IO_TIMERS; timer++) {
		action_cache[actions].base = io_timers[timer].base;

		if (action_cache[actions].base) {
			uint32_t first_channel_index = io_timers_channel_mapping.element[timer].first_channel_index;
			uint32_t last_channel_index = first_channel_index + io_timers_channel_mapping.element[timer].channel_count;

			for (uint32_t channel = first_channel_index; channel < last_channel_index; channel++) {
				mask = get_channel_mask(channel);

				if (oneshots & mask) {
					action_cache[actions].triggers |= timer_io_channels[channel].sub_module_bits;
				}
			}

			actions++;
		}
	}

	/* Now do them all with the shortest delay in between */

	irqstate_t flags = px4_enter_critical_section();

	for (actions = 0; action_cache[actions].base != 0 &&  actions < MAX_IO_TIMERS; actions++) {
		_REG16(action_cache[actions].base, IMXRT_FLEXPWM_MCTRL_OFFSET) |= (action_cache[actions].triggers >> MCTRL_LDOK_SHIFT)
				<< MCTRL_CLDOK_SHIFT ;
		_REG16(action_cache[actions].base, IMXRT_FLEXPWM_MCTRL_OFFSET) |= action_cache[actions].triggers;
	}

	px4_leave_critical_section(flags);
}

int io_timer_init_timer(unsigned timer)
{
	/* Do this only once per timer */

	int rv = is_timer_uninitalized(timer);

	if (rv == 0) {

		irqstate_t flags = px4_enter_critical_section();

		set_timer_initalized(timer);

		/* enable the timer clock before we try to talk to it */

		switch (io_timers[timer].base) {
		case IMXRT_FLEXPWM1_BASE:
			imxrt_clockall_pwm1();
			break;

		case IMXRT_FLEXPWM2_BASE:
			imxrt_clockall_pwm2();
			break;

		case IMXRT_FLEXPWM3_BASE:
			imxrt_clockall_pwm3();
			break;

		case IMXRT_FLEXPWM4_BASE:
			imxrt_clockall_pwm4();
			break;
		}

		uint32_t first_channel_index = io_timers_channel_mapping.element[timer].first_channel_index;
		uint32_t last_channel_index = first_channel_index + io_timers_channel_mapping.element[timer].channel_count;

		for (uint32_t chan = first_channel_index; chan < last_channel_index; chan++) {

			/* Clear all Faults */
			rFSTS0(timer) = FSTS_FFLAG_MASK;

			rCTRL2(timer, timer_io_channels[chan].sub_module) = SMCTRL2_CLK_SEL_EXT_CLK | SMCTRL2_DBGEN | SMCTRL2_INDEP;
			rCTRL(timer, timer_io_channels[chan].sub_module)  = SMCTRL_PRSC_DIV16 | SMCTRL_FULL;
			/* Edge aligned at 0 */
			rINIT(channels_timer(chan), timer_io_channels[chan].sub_module) = 0;
			rVAL0(channels_timer(chan), timer_io_channels[chan].sub_module) = 0;
			rVAL2(channels_timer(chan), timer_io_channels[chan].sub_module) = 0;
			rVAL4(channels_timer(chan), timer_io_channels[chan].sub_module) = 0;
			rFFILT0(timer) &= ~FFILT_FILT_PER_MASK;
			rDISMAP0(timer, timer_io_channels[chan].sub_module) = 0xf000;
			rDISMAP1(timer, timer_io_channels[chan].sub_module) = 0xf000;
			rOUTEN(timer) |= timer_io_channels[chan].val_offset == PWMA_VAL ? OUTEN_PWMA_EN(1 << timer_io_channels[chan].sub_module)
					 : OUTEN_PWMB_EN(1 << timer_io_channels[chan].sub_module);
			rDTSRCSEL(timer) = 0;
			rMCTRL(timer) = MCTRL_LDOK(1 << timer_io_channels[chan].sub_module);
			rMCTRL(timer) = timer_io_channels[chan].sub_module_bits;
			io_timer_set_PWM_mode(chan);
			timer_set_rate(chan, 50);
		}

		px4_leave_critical_section(flags);
	}

	return rv;
}


int io_timer_set_rate(unsigned channel, unsigned rate)
{
	int rv = EBUSY;

	/* Get the channel bits that belong to the channel */

	uint32_t channels = get_channel_mask(channel);

	/* Check that all channels are either in PWM or Oneshot */

	if ((channels & (channel_allocations[IOTimerChanMode_PWMOut] |
			 channel_allocations[IOTimerChanMode_OneShot] |
			 channel_allocations[IOTimerChanMode_NotUsed])) ==
	    channels) {

		/* Change only a timer that is owned by pwm or one shot */

		/* Request to use OneShot ?*/

		if (rate == 0) {

			/* Request to use OneShot
			 *
			 * We are here because ALL these channels were either PWM or Oneshot
			 * Now they need to be Oneshot
			 */

			/* Did the allocation change */
			if (reallocate_channel_resources(channels, IOTimerChanMode_PWMOut, IOTimerChanMode_OneShot)) {
				io_timer_set_oneshot_mode(channel);
			}

		} else {

			/* Request to use PWM
			 *
			 * We are here because  ALL these channels were either PWM or Oneshot
			 * Now they need to be PWM
			 */

			if (reallocate_channel_resources(channels, IOTimerChanMode_OneShot, IOTimerChanMode_PWMOut)) {
				io_timer_set_PWM_mode(channel);
			}

			timer_set_rate(channel, rate);
		}

		rv = OK;
	}

	return rv;
}

int io_timer_channel_init(unsigned channel, io_timer_channel_mode_t mode,
			  channel_handler_t channel_handler, void *context)
{
	uint32_t gpio = 0;

	/* figure out the GPIO config first */

	switch (mode) {

	case IOTimerChanMode_OneShot:
	case IOTimerChanMode_PWMOut:
	case IOTimerChanMode_Trigger:
		gpio = timer_io_channels[channel].gpio_out;
		break;

	case IOTimerChanMode_PWMIn:
	case IOTimerChanMode_Capture:
		return -EINVAL;
		break;

	case IOTimerChanMode_NotUsed:
		break;

	default:
		return -EINVAL;
	}

	int rv = allocate_channel(channel, mode);

	/* Valid channel should now be reserved in new mode */

	if (rv >= 0) {

		unsigned timer = channels_timer(channel);

		/* Blindly try to initialize the timer - it will only do it once */

		io_timer_init_timer(timer);

